000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ПечатьЭтикетокИЦенников/ПечатьЭтикетокИЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьЭтикетокИЦенников</name>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НажатаПечать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьИзДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьИзОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>Режим</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьЦеныИзИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеныНаДату</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеныНазначенныеДействующие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеныПоВидуЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтарыеЦеныНаДату</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерЦенника</name>
    <type>
      <types>EnumRef.РазмерЦенника</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсходныеДанные</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтараяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаУценки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценка</name>
      <type>
        <types>CatalogRef.СкидкиНаценки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСкидкиНаценки</name>
      <type>
        <types>EnumRef.ТипСкидкиНаценки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПереоценки</name>
      <type>
        <types>EnumRef.ТипыПереоценок</types>
      </type>
    </attributes>
    <attributes>
      <name>БонусАкцияСписан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусБазаНачислен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЦенника</name>
      <type>
        <types>CatalogRef.ХранилищеШаблонов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЦенников</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЭтикетки</name>
      <type>
        <types>CatalogRef.ХранилищеШаблонов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЭтикеток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВДокументе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>SKU</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СтараяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаУценки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКомплекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценка</name>
      <type>
        <types>CatalogRef.СкидкиНаценки</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСкидкиНаценки</name>
      <type>
        <types>EnumRef.ТипСкидкиНаценки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПереоценки</name>
      <type>
        <types>EnumRef.ТипыПереоценок</types>
      </type>
    </attributes>
    <attributes>
      <name>ОЧ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусАкцияСписан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусБазаНачислен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеКомплекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ПечатьЭтикетокИЦенников/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ПечатьИзДокумента Тогда
		МассивНепроверяемыхРеквизитов.Добавить("МагазинДляЦен");
		МассивНепроверяемыхРеквизитов.Добавить("ВидЦены");
	Иначе
		Если ЦеныПоВидуЦены Тогда
			МассивНепроверяемыхРеквизитов.Добавить("МагазинДляЦен");
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ВидЦены");
		КонецЕсли;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ШаблонЦенника");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ШаблонЭтикетки");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоЦенников");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоЭтикеток");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если ЭтотОбъект.НажатаПечать Тогда
		ПроверитьЗаполнениеШаблоновЦенниковИЭтикеток(Отказ);
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПроверитьЗаполнениеШаблоновЦенниковИЭтикеток(Отказ)

	ПроверятьЦенники = (ЭтотОбъект.Режим = "ПечатьЦенниковИЭтикеток") ИЛИ (ЭтотОбъект.Режим = "ПечатьЦенников");
	ПроверятьЭтикетки = (ЭтотОбъект.Режим = "ПечатьЦенниковИЭтикеток") ИЛИ (ЭтотОбъект.Режим = "ПечатьЭтикеток");
	
	ШаблонСообщенияЦенники  = НСтр("ru='Не заполнена колонка ""Шаблон ценника"" в строке %НомерСтроки%.'");
	ШаблонСообщенияЭтикетки = НСтр("ru='Не заполнена колонка ""Шаблон этикетки"" в строке %НомерСтроки%.'");
	
	ШаблонСообщенияЦенникиКоличество  = НСтр("ru='Не заполнена колонка ""Количество ценников"" в строке %НомерСтроки%.'");
	ШаблонСообщенияЭтикеткиКоличество = НСтр("ru='Не заполнена колонка ""Количество этикеток"" в строке %НомерСтроки%.'");
	
	СтрокиВыбран = ЭтотОбъект.Товары.НайтиСтроки(Новый Структура("Выбран", Истина));
	
	Для каждого СтрокаТаблицы Из СтрокиВыбран Цикл
	
		Если ПроверятьЦенники И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ШаблонЦенника) Тогда
			
			Отказ = Истина;
			ТекстСообщения = СтрЗаменить(ШаблонСообщенияЦенники, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТаблицы.НомерСтроки, "ШаблонЦенника");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле,"Объект", Отказ);
			
		КонецЕсли;
		
		Если ПроверятьЦенники И НЕ ЗначениеЗаполнено(СтрокаТаблицы.КоличествоЦенников) Тогда
			
			Отказ = Истина;
			ТекстСообщения = СтрЗаменить(ШаблонСообщенияЦенникиКоличество, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТаблицы.НомерСтроки, "КоличествоЦенников");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле,"Объект", Отказ);
			
		КонецЕсли;
		
		Если ПроверятьЭтикетки И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ШаблонЭтикетки) Тогда
			
			Отказ = Истина;
			ТекстСообщения = СтрЗаменить(ШаблонСообщенияЭтикетки, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТаблицы.НомерСтроки, "ШаблонЭтикетки");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле,"Объект", Отказ);
			
		КонецЕсли;
			
		Если ПроверятьЭтикетки И НЕ ЗначениеЗаполнено(СтрокаТаблицы.КоличествоЭтикеток) Тогда
			
			Отказ = Истина;
			ТекстСообщения = СтрЗаменить(ШаблонСообщенияЭтикеткиКоличество, "%НомерСтроки%", СтрокаТаблицы.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТаблицы.НомерСтроки, "КоличествоЭтикеток");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,Поле,"Объект", Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры
